//
// - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//     за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподібні, тобто приводиться до false)




let x = 0

// if (x === false){
//   x = 'default'
// }
// console.log(x)
// if (x === '' || x === 0 || x === null || x === false) {
//     x = 'default'
// }
// console.log(x)

x = x ||  'default';
console.log(x)